; -----------------------------------------------------
; PC-1245 グラフィックパターン表示サブルーチン（1〜12桁専用版）
; 配置アドレス：
;	$C500〜$C537 (56bytes)
; ワークエリア：
;	$C53A	: 表示桁位置（0〜11）
;	$C53B	: キャラクターパターン番号
;	$C540〜	: キャラクターデータ、予めBASICなどから設定しておくこと
; -----------------------------------------------------
	ORG	$C500

	; ----------------------------------------
	; 1. キャラクタデータ先頭アドレス(X)の計算
	; ----------------------------------------
	LIB	$C5
	LIA	$40
	CAL	$11F1		; X ← BA - 1 ($C53F: データ領域$C540の直前を設定)

	LIDP	$C53B		; キャラクタ番号のアドレス
	LDD			; A ← キャラクタ番号
	CPIA	0
	JRZP	X_CALC_END	; 0番なら加算処理を飛ばして前方(Plus)へジャンプ

	LP	$08		; 内部RAM $08 (Kレジスタ) をループカウンタに設定
	EXAM			; K ← A
X_CALC_LOOP:
	IX
	IX
	IX
	IX
	IX			; X を +5 する (1キャラ5バイト分)
	DECK			; K ← K - 1
	JRNZM	X_CALC_LOOP	; K > 0 なら後方(Minus)へ戻ってループ[cite: 3]
X_CALC_END:

	; ----------------------------------------
	; 2. VRAM開始アドレス(Y)の計算 (左画面0〜11桁目専用)
	; ----------------------------------------
	LIB	$F8
	LIA	$00
	CAL	$11F5		; Y ← BA - 1 = $F7FF (0桁目開始$F800の直前)

	LIDP	$C53A		; 桁位置のアドレス
	LDD			; A ← 桁位置
	CPIA	0
	JRZP	LEFT_DRAW	; 0桁目なら加算処理を飛ばして前方(Plus)へジャンプ[cite: 3]

	LP	$08
	EXAM			; K ← A
LEFT_CALC_LOOP:
	IY
	IY
	IY
	IY
	IY			; Y を +5 する
	DECK
	JRNZM	LEFT_CALC_LOOP	; K > 0 なら後方(Minus)へ戻ってループ[cite: 3]

LEFT_DRAW:
	; 左画面へのデータ転送 (アドレス増加方向)
	LIA	4		; 転送ループ回数 (5-1)
	PUSH			; スタックに回数を入れる
LEFT_DRAW_LOOP:
	IXL			; X ← X + 1, A ← (X)
	IYS			; Y ← Y + 1, (Y) ← A (プレインクリメント・ストア)
	LOOP	LEFT_DRAW_LOOP	; スタックの値+1回ループ
	RTN			; BASICへ戻る

; -----------------------------------------------------
; グラフィックパターンデータ
; 配置アドレス：
;	$C540〜$C58A (75bytes)
; -----------------------------------------------------
	ORG	$C540
	DB	0x00, 0x00, 0x00, 0x00, 0x00	;  0 : 空白（消去用）
	DB	0x00, 0x00, 0x08, 0x00, 0x00	;  1 : エサ
	DB	0x00, 0x08, 0x1C, 0x08, 0x00	;  2 : パワーエサ
	DB	0x7E, 0x33, 0x7F, 0x33, 0x7E	;  3 : モンスター
	DB	0x7E, 0x2D, 0x41, 0x2D, 0x7E	;  4 : モンスター（イジケ）
	DB	0x41, 0x63, 0x77, 0x7F, 0x3E	;  5 : パックマン2（左向き）
	DB	0x3E, 0x7F, 0x7F, 0x7F, 0x3E	;  6 : パックマン1
	DB	0x3E, 0x7F, 0x77, 0x63, 0x41	;  7 : パックマン2（右向き）
	DB	0x22, 0x00, 0x22, 0x22, 0x63	;  8 : ワープトンネル（左）
	DB	0x63, 0x22, 0x22, 0x00, 0x22	;  9 : ワープトンネル（右）
	DB	0x3E, 0x7C, 0x78, 0x7C, 0x3E	; 10 : パックマンヤラレ1
	DB	0x38, 0x78, 0x78, 0x78, 0x38	; 11 : パックマンヤラレ2
	DB	0x20, 0x70, 0x78, 0x70, 0x20	; 12 : パックマンヤラレ3
	DB	0x00, 0x00, 0x70, 0x00, 0x00	; 13 : パックマンヤラレ4
	DB	0x49, 0x22, 0x00, 0x22, 0x49	; 14 : パックマンヤラレ5
